acpid
base
base-devel
bash-language-server
booster
btrfs-progs
busybox
chafa
clang
cliphist
dosfstools
fd
foot
fzf
git
grim
imagemagick
intel-media-driver
intel-ucode
iwd
linux
linux-firmware
linux-headers
lua-language-server
man-db
meson
mpv
mpv-mpris
neovim
noto-fonts-cjk
noto-fonts-emoji
openssh
pacman-contrib
playerctl
podman
pyright
qpdf
qutebrowser
reflector
ripgrep
rtkit
shellcheck
slurp
sof-firmware
swaybg
swayidle
tesseract-data-ind
tree
ttf-hack-nerd
typst
vulkan-intel
wayland-protocols
wget
wl-clipboard
wlroots0.19
wlsunset
yt-dlp
zathura
zathura-pdf-mupdf
zram-generator
zsh
zsh-completions
zsh-syntax-highlighting
